#Задачи на циклы и оператор условия_pro
#----------------------------------------
'''
(!!!Подсказка на следующие 5 задач - превратите число в строку, а потом работайте с строкой)
Задача 6
Найти сумму цифр числа.
'''
sum = 0
for i in input('введите число: '):
    sum += int(i)
print(f'сумма цифр числа = {sum}')

'''
Задача 7
Найти произведение цифр числа.
'''
prod = 1
for i in input('введите число: '):
    prod *= int(i)
print(f'произведение цифр числа = {prod}')

'''
Задача 8
Пользователь должен ввести число. Ваш код должен дать ответ на вопрос: есть ли среди цифр числа 5?
Если есть, код должен вывексти "Цифра 5 есть в числе", в противном случае вывести: "Цифры 5 нет в числе".
'''
if '5' in input('введите число: '):
    print('Цифра 5 есть в числе')
else:
    print('Цифры 5 нет в числе')

'''
Задача 9
Найти максимальную цифру в числе
'''
user_ = input('введите число: ')
max_ = 0
for i in user_:
    if int(i) > max_:
        max_ = int(i)
print(f'цифра {max_} - максимальная в числе {user_}')
'''
Задача 10
Найти количество цифр 5 в числе
'''
user_ = input('введите число: ')
print(f'количество цифр 5 в числе {user_} = {user_.count("5")}')